// 自動生成されたコードです。変更しないでください。
namespace myImages {

    helpers._registerFactory("image", function(name: string) {
        switch(helpers.stringTrim(name)) {
            case "image1":return img`
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
`;
            case "image2":
            case "bogy":return img`
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . 8 8 8 . 
. . . . . . . . . . . 8 8 8 . 2 
. . . . . . . . 8 8 8 8 8 8 5 4 
. . . . . . . 8 8 8 8 8 8 8 5 4 
. . . . . 8 8 f f 8 8 8 8 8 . 2 
8 8 8 8 8 8 8 8 f f 8 8 8 8 . . 
9 9 9 8 8 8 8 8 8 8 8 8 8 8 . . 
. . . 9 9 9 8 8 8 8 8 8 8 8 . . 
. . . . . . 9 9 9 8 8 8 8 8 . 2 
. . . . . . . . . 9 9 8 8 8 5 4 
. . . . . . . . . . . 9 8 8 5 4 
. . . . . . . . . . . . 8 8 . 2 
`;
        }
        return null;
    })

    helpers._registerFactory("animation", function(name: string) {
        switch(helpers.stringTrim(name)) {

        }
        return null;
    })

}
// 自動生成されたコードです。変更しないでください。
